#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

  ```

  Success! The configuration is valid.


  ```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

  ```

  # terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # module.cluster-1.google_container_cluster.primary[0m will be created
[0m  [32m+[0m[0m resource "google_container_cluster" "primary" {
      [32m+[0m[0m cluster_ipv4_cidr           = (known after apply)
      [32m+[0m[0m datapath_provider           = (known after apply)
      [32m+[0m[0m default_max_pods_per_node   = (known after apply)
      [32m+[0m[0m enable_binary_authorization = false
      [32m+[0m[0m enable_intranode_visibility = (known after apply)
      [32m+[0m[0m enable_kubernetes_alpha     = false
      [32m+[0m[0m enable_l4_ilb_subsetting    = false
      [32m+[0m[0m enable_legacy_abac          = false
      [32m+[0m[0m enable_shielded_nodes       = true
      [32m+[0m[0m endpoint                    = (known after apply)
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m initial_node_count          = 1
      [32m+[0m[0m label_fingerprint           = (known after apply)
      [32m+[0m[0m location                    = "us-central1-c"
      [32m+[0m[0m logging_service             = (known after apply)
      [32m+[0m[0m master_version              = (known after apply)
      [32m+[0m[0m monitoring_service          = (known after apply)
      [32m+[0m[0m name                        = "cluster-1"
      [32m+[0m[0m network                     = "default"
      [32m+[0m[0m networking_mode             = (known after apply)
      [32m+[0m[0m node_locations              = (known after apply)
      [32m+[0m[0m node_version                = (known after apply)
      [32m+[0m[0m operation                   = (known after apply)
      [32m+[0m[0m private_ipv6_google_access  = (known after apply)
      [32m+[0m[0m project                     = "istiosetup"
      [32m+[0m[0m remove_default_node_pool    = true
      [32m+[0m[0m self_link                   = (known after apply)
      [32m+[0m[0m services_ipv4_cidr          = (known after apply)
      [32m+[0m[0m subnetwork                  = (known after apply)
      [32m+[0m[0m tpu_ipv4_cidr_block         = (known after apply)

      [32m+[0m[0m workload_identity_config {
          [32m+[0m[0m workload_pool = "istiosetup.svc.id.goog"
        }
    }

[1m  # module.cluster-1-node-pool.google_container_node_pool.primary_preemptible_nodes[0m will be created
[0m  [32m+[0m[0m resource "google_container_node_pool" "primary_preemptible_nodes" {
      [32m+[0m[0m cluster                     = "cluster-1"
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m initial_node_count          = (known after apply)
      [32m+[0m[0m instance_group_urls         = (known after apply)
      [32m+[0m[0m location                    = "us-central1-c"
      [32m+[0m[0m managed_instance_group_urls = (known after apply)
      [32m+[0m[0m max_pods_per_node           = (known after apply)
      [32m+[0m[0m name                        = "cluster-1-node-pool"
      [32m+[0m[0m name_prefix                 = (known after apply)
      [32m+[0m[0m node_count                  = 1
      [32m+[0m[0m node_locations              = (known after apply)
      [32m+[0m[0m operation                   = (known after apply)
      [32m+[0m[0m project                     = (known after apply)
      [32m+[0m[0m version                     = (known after apply)

      [32m+[0m[0m node_config {
          [32m+[0m[0m disk_size_gb      = (known after apply)
          [32m+[0m[0m disk_type         = (known after apply)
          [32m+[0m[0m guest_accelerator = (known after apply)
          [32m+[0m[0m image_type        = (known after apply)
          [32m+[0m[0m labels            = (known after apply)
          [32m+[0m[0m local_ssd_count   = (known after apply)
          [32m+[0m[0m logging_variant   = "DEFAULT"
          [32m+[0m[0m machine_type      = "n1-standard-2"
          [32m+[0m[0m metadata          = (known after apply)
          [32m+[0m[0m min_cpu_platform  = (known after apply)
          [32m+[0m[0m oauth_scopes      = [
              [32m+[0m[0m "https://www.googleapis.com/auth/cloud-platform",
            ]
          [32m+[0m[0m preemptible       = true
          [32m+[0m[0m service_account   = "k8s-sa@istiosetup.iam.gserviceaccount.com"
          [32m+[0m[0m spot              = false
          [32m+[0m[0m taint             = (known after apply)
        }
    }

[1m  # module.cluster-2.google_container_cluster.primary[0m will be created
[0m  [32m+[0m[0m resource "google_container_cluster" "primary" {
      [32m+[0m[0m cluster_ipv4_cidr           = (known after apply)
      [32m+[0m[0m datapath_provider           = (known after apply)
      [32m+[0m[0m default_max_pods_per_node   = (known after apply)
      [32m+[0m[0m enable_binary_authorization = false
      [32m+[0m[0m enable_intranode_visibility = (known after apply)
      [32m+[0m[0m enable_kubernetes_alpha     = false
      [32m+[0m[0m enable_l4_ilb_subsetting    = false
      [32m+[0m[0m enable_legacy_abac          = false
      [32m+[0m[0m enable_shielded_nodes       = true
      [32m+[0m[0m endpoint                    = (known after apply)
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m initial_node_count          = 1
      [32m+[0m[0m label_fingerprint           = (known after apply)
      [32m+[0m[0m location                    = "us-east1-b"
      [32m+[0m[0m logging_service             = (known after apply)
      [32m+[0m[0m master_version              = (known after apply)
      [32m+[0m[0m monitoring_service          = (known after apply)
      [32m+[0m[0m name                        = "cluster-2"
      [32m+[0m[0m network                     = "default"
      [32m+[0m[0m networking_mode             = (known after apply)
      [32m+[0m[0m node_locations              = (known after apply)
      [32m+[0m[0m node_version                = (known after apply)
      [32m+[0m[0m operation                   = (known after apply)
      [32m+[0m[0m private_ipv6_google_access  = (known after apply)
      [32m+[0m[0m project                     = "istiosetup"
      [32m+[0m[0m remove_default_node_pool    = true
      [32m+[0m[0m self_link                   = (known after apply)
      [32m+[0m[0m services_ipv4_cidr          = (known after apply)
      [32m+[0m[0m subnetwork                  = (known after apply)
      [32m+[0m[0m tpu_ipv4_cidr_block         = (known after apply)

      [32m+[0m[0m workload_identity_config {
          [32m+[0m[0m workload_pool = "istiosetup.svc.id.goog"
        }
    }

[1m  # module.cluster-2-node-pool.google_container_node_pool.primary_preemptible_nodes[0m will be created
[0m  [32m+[0m[0m resource "google_container_node_pool" "primary_preemptible_nodes" {
      [32m+[0m[0m cluster                     = "cluster-2"
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m initial_node_count          = (known after apply)
      [32m+[0m[0m instance_group_urls         = (known after apply)
      [32m+[0m[0m location                    = "us-east1-b"
      [32m+[0m[0m managed_instance_group_urls = (known after apply)
      [32m+[0m[0m max_pods_per_node           = (known after apply)
      [32m+[0m[0m name                        = "cluster-2-node-pool"
      [32m+[0m[0m name_prefix                 = (known after apply)
      [32m+[0m[0m node_count                  = 1
      [32m+[0m[0m node_locations              = (known after apply)
      [32m+[0m[0m operation                   = (known after apply)
      [32m+[0m[0m project                     = (known after apply)
      [32m+[0m[0m version                     = (known after apply)

      [32m+[0m[0m node_config {
          [32m+[0m[0m disk_size_gb      = (known after apply)
          [32m+[0m[0m disk_type         = (known after apply)
          [32m+[0m[0m guest_accelerator = (known after apply)
          [32m+[0m[0m image_type        = (known after apply)
          [32m+[0m[0m labels            = (known after apply)
          [32m+[0m[0m local_ssd_count   = (known after apply)
          [32m+[0m[0m logging_variant   = "DEFAULT"
          [32m+[0m[0m machine_type      = "n1-standard-2"
          [32m+[0m[0m metadata          = (known after apply)
          [32m+[0m[0m min_cpu_platform  = (known after apply)
          [32m+[0m[0m oauth_scopes      = [
              [32m+[0m[0m "https://www.googleapis.com/auth/cloud-platform",
            ]
          [32m+[0m[0m preemptible       = true
          [32m+[0m[0m service_account   = "k8s-sa@istiosetup.iam.gserviceaccount.com"
          [32m+[0m[0m spot              = false
          [32m+[0m[0m taint             = (known after apply)
        }
    }

[1mPlan:[0m 4 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

  
  ```

</details>

*Pusher: @gunavardhanganji, Action: `pull_request`, Workflow: `Apply Terraform on PR`*